Repository: luka-loehr/LGKA
Catalog: lib/l10n/app_*.arb
Languages: de

# welcomeTitle
source: Welcome to LGKA+
de: Willkommen bei LGKA+

source: Substitution Plan
de: Vertretungsplan

source: Weather
de: Wetter

source: Schedule
de: Stundenplan

# legal
source: Legal Notice
de: Impressum

# privacy
source: Privacy Policy
de: Datenschutz

# krankmeldung
source: Sick Note
de: Krankmeldung

# krankmeldungDisclaimer
source: The sick note is provided by Lessing-Gymnasium and is independent of the LGKA+ app.
de: Die Krankmeldung wird vom Lessing-Gymnasium bereitgestellt und ist unabhängig von der LGKA+ App.

# krankmeldungContact
source: For technical questions or problems, please contact Lessing-Gymnasium Karlsruhe directly.
de: Bei technischen Fragen oder Problemen wende dich bitte direkt an das Lessing-Gymnasium Karlsruhe.

# krankmeldungButton
source: To Sick Note
de: Zur Krankmeldung

# serverMaintenance
source: Maintenance work in progress
de: Reparaturarbeiten werden durchgeführt

source: Server connection failed
de: Serververbindung fehlgeschlagen

# serverConnectionHint
source: This may be due to no internet connection or ongoing maintenance at Lessing-Gymnasium.
de: Möglicherweise besteht keine Internetverbindung oder es finden gerade Wartungsarbeiten am Lessing-Gymnasium statt.

source: Try again
de: Erneut versuchen

source: Live Weather Data
de: Live Wetterdaten

source: Data being collected
de: Daten werden gesammelt

# liveWeatherDescription
source: Directly from the school's own weather station on the roof. Real-time data from your school!
de: Direkt von der schuleigenen Wetterstation auf dem Dach. Echtzeit-Daten von deiner Schule!

# dataCollectionDescription
source: The weather station is currently collecting new data for today. Charts and additional values will be displayed once enough data points are available.
de: Die Wetterstation sammelt gerade neue Daten für heute. Diagramme sind ab 0:30 Uhr verfügbar.

# welcomeHeadline
source: Welcome!
de: Willkommen!

# welcomeSubtitle
source: To the new app for Lessing-Gymnasium Karlsruhe.
de: Bei der neuen App fürs Lessing-Gymnasium Karlsruhe.

# continueLabel
source: Continue
de: Weiter

source: Today
de: Heute

source: Tomorrow
de: Morgen

# loadingSubstitutions
source: Loading substitution plans...
de: Lade Vertretungspläne...

source: Error loading
de: Fehler beim Laden

source: No info yet
de: Noch keine Infos

source: Settings
de: Einstellungen

source: Accent color
de: Akzentfarbe

# chooseAccentColor
source: Choose your preferred accent color
de: Wähle deine bevorzugte Akzentfarbe

# classes5to7
source: Grades 5-7
de: Klassenstufe 5-7

# classes8to10
source: Grades 8-10
de: Klassenstufe 8-10

source: Upper school
de: Oberstufe

# privacyLabel
source: Privacy Policy
de: Datenschutzerklärung

# legalLabel
source: Legal Notice
de: Impressum

source: Loading...
de: Lädt...

# formLoadError
source: Form could not be loaded
de: Formular konnte nicht geladen werden

# formLoadErrorHint
source: Please check your internet connection and try again.
de: Bitte überprüfe deine Internetverbindung und versuche es erneut.

# infoHeader
source: All Features at a Glance
de: Was kannst du mit der App machen?

# featureSubstitutionTitle
source: Substitution Plan
de: Vertretungsplan

# featureSubstitutionDesc
source: Current substitution plan for today/tomorrow
de: Aktueller Vertretungsplan für heute/morgen

# featureScheduleTitle
source: Schedule
de: Stundenplan

# featureScheduleDesc
source: Schedule for 1st/2nd semester
de: Stundenplan fürs 1./2. Halbjahr

# featureWeatherTitle
source: Weather Data
de: Wetterdaten

# featureWeatherDesc
source: Access the school's own weather station
de: Zugriff auf die eigene Wetterstation der Schule

# featureSickTitle
source: Sick Note
de: Krankmeldung

# featureSickDesc
source: Submit a sick note directly via the app
de: Krankmeldung direkt über die App einreichen

source: Your accent color
de: Deine Akzentfarbe

# chooseFavoriteColor
source: Choose your favorite color. It will be used throughout the app.
de: Wähle deine Lieblingsfarbe aus. Diese wird überall in der App verwendet.

source: Let's go!
de: Los geht's!

# krankmeldungInfoHeader
source: Sick Note Information
de: Hinweis zur Krankmeldung

source: Loading sick note...
de: Lade Krankmeldung...

# loadingWeather
source: Loading weather data...
de: Lade Wetterdaten...

# noWeatherData
source: No weather data available
de: Keine Wetterdaten verfügbar

# temperatureLabel
source: Temperature
de: Temperatur

# humidityLabel
source: Humidity
de: Luftfeuchtigkeit

# windSpeedLabel
source: Wind
de: Windgeschwindigkeit

# pressureLabel
source: Sun
de: Luftdruck

# temperatureTodayTitle
source: Temperature
de: Temperaturverlauf heute

# humidityTodayTitle
source: Humidity
de: Luftfeuchtigkeitsverlauf heute

# windSpeedTodayTitle
source: Wind Speed
de: Windgeschwindigkeitsverlauf heute

# pressureTodayTitle
source: Solar Radiation
de: Luftdruckverlauf heute

# yAxisTemperature
source: Temperature (°C)
de: Temperatur (°C)

# yAxisHumidity
source: Humidity (%)
de: Luftfeuchtigkeit (%)

# yAxisWindSpeed
source: Wind (km/h)
de: Windgeschwindigkeit (km/h)

# yAxisPressure
source: Sun (W/m²)
de: Luftdruck (hPa)

# timeLabel
source: Time
de: Uhrzeit

# chartsAvailableAt
source: Charts are available from 0:30 AM.
de: Diagramme sind ab 0:30 Uhr verfügbar.

source: Checking availability...
de: Prüfe Verfügbarkeit...

source: Loading schedules...
de: Lade Stundenpläne...

source: No schedules available
de: Keine Stundenpläne verfügbar

# tryAgainLater
source: Please try again later
de: Versuche es später erneut

source: Loading schedule...
de: Lade Stundenplan...

# notAvailableYet
source: is not available yet
de: ist noch nicht verfügbar

# errorLoadingGeneric
source: Error loading
de: Fehler beim Laden

source: Search in PDF
de: Im PDF suchen

source: Cancel search
de: Suche abbrechen

source: Previous result
de: Vorheriges Ergebnis

source: Next result
de: Nächstes Ergebnis

source: New search
de: Neue Suche

source: Share PDF
de: PDF teilen

# scheduleTitle
source: Schedule
de: Stundenplan

# documentTitle
source: Document
de: Dokument

# filenameSchedulePrefix
source: LGKA_Schedule_
de: LGKA_Stundenplan_

# subjectSchedule
source: LGKA+ Schedule
de: LGKA+ Stundenplan

# filenameSubstitutionPrefix
source: LGKA_Substitution_
de: LGKA_Vertretungsplan_

# subjectSubstitution
source: LGKA+ Substitution
de: LGKA+ Vertretungsplan

source: Username
de: Benutzername

source: Password
de: Passwort

source: Log in
de: Anmelden

# authTitle
source: Authentication required
de: Anmeldung erforderlich

# authSubtitle
source: Use the credentials you already know from the school website
de: Verwende die Zugangsdaten, die du bereits vom Vertretungsplan kennst

# searchHint
source: Enter your class
de: Suchbegriff eingeben...

# firstSemester
source: 1st semester
de: 1. Halbjahr

# secondSemester
source: 2nd semester
de: 2. Halbjahr

# grades5to10
source: Grades 5-10
de: Klassen 5-10

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

# scheduleNotAvailable
source: is not available yet
de: ist noch nicht verfügbar

# chartLoading
source: Chart is loading...
de: Diagramm wird geladen...

# singleResultFound
source: We'll always show class {query} for you now.
de: 1 Ergebnis gefunden

# multipleResultsFound
source: {count} results found
de: {count} Ergebnisse gefunden

# noResultsFound
source: Class doesn't exist
de: Keine Ergebnisse gefunden

# shareError
source: Error sharing
de: Fehler beim Teilen

# errorNavigatingToPage
source: Error navigating to page {page}
de: Fehler beim Navigieren zur Seite {page}

# foundPages
source: Found pages: {pages}
de: Gefundene Seiten: {pages}
